### **Atividade - Prática de Pré-processamento**

**Objetivo**

Preparar os dados do Titanic para treinar um modelo que possa prever se um passageiro sobreviveu ou não.

### 1. Configurar o ambiente

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.decomposition import PCA

### 2. Carregar a base de dados

In [3]:
df = sns.load_dataset('titanic')

In [4]:
# Formato da base
df.shape

(891, 15)

In [6]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### 3. Informações iniciais

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [8]:
# Valores ausentes
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### 4. Seleção de variáveis

- **Numéricas**: idade, tarifa
- **Categóricas**: sexo, classe, local de embarque
- **Alvo**: survived (0 = não sobreviveu, 1 = sobreviveu)

In [9]:
cols_num = ['age', 'fare']
cols_cat = ['sex', 'class', 'embarked']
target = 'survived'

### 5. Tratamento de valores ausentes

In [10]:
im_num = SimpleImputer(strategy='median')
im_cat = SimpleImputer(strategy='most_frequent')

In [11]:
for col in cols_num:
    df[col] = im_num.fit_transform(df[[col]])

### 6. Transformação de variáveis categóricas

In [12]:
enc = OneHotEncoder(handle_unknown='ignore', sparse_output=False)
encoded = pd.DataFrame(enc.fit_transform(df[cols_cat]))

df_processed = pd.concat([
    df[cols_num].reset_index(drop=True),
    encoded.reset_index(drop=True)
], axis=1)

### 7. Padronização de variáveis numéricas

In [13]:
scaler = StandardScaler()
df_processed[cols_num] = scaler.fit_transform(df_processed[cols_num])

### 9. Divisão treino e teste

In [14]:
X = df_processed
y = df[target]

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [15]:
print("Treino:", X_train.shape, " | Teste:", X_test.shape)

Treino: (623, 11)  | Teste: (268, 11)